In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("01_ADS_Sample_1.csv")
df.head(2)

  YEAR_MONTH  SOCIAL     TV  NEWSPAPER  SALES_AMT
0   2005-Dec   84.72  19.20      48.96      14.28
1   2006-Jan  351.48  33.96      51.84      11.52

In [4]:
df_corr = df.corr()
df_corr

             SOCIAL        TV  NEWSPAPER  SALES_AMT
SOCIAL     1.000000  0.081734   0.102198   0.037020
TV         0.081734  1.000000   0.280012  -0.183192
NEWSPAPER  0.102198  0.280012   1.000000   0.002282
SALES_AMT  0.037020 -0.183192   0.002282   1.000000

In [5]:
round(df_corr.iloc[1, 3], 3)

-0.183

In [6]:
df.head(6)

  YEAR_MONTH  SOCIAL     TV  NEWSPAPER  SALES_AMT
0   2005-Dec   84.72  19.20      48.96      14.28
1   2006-Jan  351.48  33.96      51.84      11.52
2   2006-Feb  135.48  20.88      46.32      20.88
3   2006-Mar  116.64   1.80      36.00      11.40
4   2006-Apr  318.72  24.00       0.36      15.36
5   2006-May  114.84   1.68       8.88      30.48

In [7]:
df[["year", "month"]] = df["YEAR_MONTH"].str.split("-", expand = True)
df.head(2)

  YEAR_MONTH  SOCIAL     TV  NEWSPAPER  SALES_AMT  year month
0   2005-Dec   84.72  19.20      48.96      14.28  2005   Dec
1   2006-Jan  351.48  33.96      51.84      11.52  2006   Jan

In [46]:
df_amt = df.groupby("year")["SALES_AMT"].sum().reset_index()
df_amt.tail(2)

    year  SALES_AMT
13  2018     218.04
14  2019     186.12

In [47]:
amt_2019 = df_amt.loc[df_amt["year"] == "2019", "SALES_AMT"]
amt_2009 = df_amt.loc[df_amt["year"] == "2009", "SALES_AMT"]

In [48]:
amt_2019

14    186.12
Name: SALES_AMT, dtype: float64

In [49]:
amt_2019.values[0]

186.12

In [50]:
amt_2019 = amt_2019.values[0]
amt_2009 = amt_2009.values[0]

In [51]:
round((amt_2019 - amt_2009) / amt_2009 * 100 , 3)

0.194

In [8]:
from scipy.stats import ttest_ind

In [53]:
stat, p = ttest_ind(df.loc[df["year"] == "2009", "SALES_AMT"],
                    df.loc[df["year"] == "2019", "SALES_AMT"])
print(round(stat, 3))
print(round(p, 3))

-0.011
0.991